Revit 2027 API
FormatOptions.IsValidSymbol(ForgeTypeId) Method
 Checks whether a symbol is valid for the unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSymbol(
	ForgeTypeId symbolTypeId
)
Public Function IsValidSymbol (
	symbolTypeId As ForgeTypeId
) As Boolean
public:
bool IsValidSymbol(
	ForgeTypeId^ symbolTypeId
)
member IsValidSymbol :
        symbolTypeId : ForgeTypeId -> bool
Parameters
symbolTypeId ForgeTypeId
 Identifier of the symbol to check.
Return Value
Boolean
 True if the symbol is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
IsValidSymbol Overload
Autodesk.Revit.DB Namespace